# DefaultLengthUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ShapeImporter..::..DefaultLengthUnit Property
ShapeImporter Class See Also
---
The length unit to be used if not specified when the input is a unitless SAT file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ImportUnit DefaultLengthUnit { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DefaultLengthUnit As ImportUnit
	Get
```

Visual C++
---
```text
public:
property ImportUnit DefaultLengthUnit {
	ImportUnit get ();
}
```

# Remarks
If the input is a unitless SAT file then this length unit will be used as a backup.
# See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace